In [27]:
import pandas as pd

data = pd.read_csv("carbon_gdp_temp.csv")

In [2]:
data.head()

,Year,Country Name,CO2 Emission,Country Code,Continent_Name,Temperature Change,GDP
0,1960,Afghanistan,0.046057,AFG,Asia,NaN,5.377778e+08
1,1960,Albania,1.258195,ALB,Europe,NaN,NaN
2,1960,Algeria,0.557120,DZA,Africa,NaN,2.723593e+09
3,1960,American Samoa,NaN,ASM,Oceania,NaN,NaN
4,1960,Andorra,NaN,AND,Europe,NaN,NaN

In [28]:
data['CO2 Emission'] = data['CO2 Emission'].fillna(data.groupby('Country Name')['CO2 Emission'].transform('mean'))

In [30]:
data['Temperature Change'] = data['Temperature Change'].fillna(data.groupby('Country Name')['Temperature Change'].transform('mean'))

In [29]:
data['GDP'] = data['GDP'].fillna(data.groupby('Country Name')['GDP'].transform('mean'))

In [32]:
data.to_csv("carbon_gdp_temp_average.csv", index=False)

In [8]:
a = pd.concat([data, new])

In [11]:
a[["CO2 Emission"]] = a[["CO2 Emission"]].apply(pd.to_numeric)

In [13]:
a.loc[a.Year<=2018]

    Year                 Country Name  CO2 Emission
0   1960                  Afghanistan      0.046057
1   1960  Africa Eastern and Southern      0.906060
2   1960   Africa Western and Central      0.090880
3   1960                      Albania      1.258195
4   1960                      Algeria      0.557120
..   ...                          ...           ...
54  2014                          All   1002.769858
55  2015                          All    991.580786
56  2016                          All    991.156993
57  2017                          All    992.850229
58  2018                          All    993.908458

[15753 rows x 3 columns]

In [14]:
a.to_csv("summed_by_country_acc.csv")

In [1]:
import pandas as pd

data = pd.read_csv("Environment_Temperature_change_E_All_Data_NOFLAG.csv")

In [2]:
data.head()

,Area Code,Area,Months Code,Months,Element Code,Element,Unit,Y1961,Y1962,Y1963,...,Y2010,Y2011,Y2012,Y2013,Y2014,Y2015,Y2016,Y2017,Y2018,Y2019
0,2,Afghanistan,7001,January,7271,Temperature change,�C,0.777,0.062,2.744,...,3.601,1.179,-0.583,1.233,1.755,1.943,3.416,1.201,1.996,2.951
1,2,Afghanistan,7001,January,6078,Standard Deviation,�C,1.950,1.950,1.950,...,1.950,1.950,1.950,1.950,1.950,1.950,1.950,1.950,1.950,1.950
2,2,Afghanistan,7002,February,7271,Temperature change,�C,-1.743,2.465,3.919,...,1.212,0.321,-3.201,1.494,-3.187,2.699,2.251,-0.323,2.705,0.086
3,2,Afghanistan,7002,February,6078,Standard Deviation,�C,2.597,2.597,2.597,...,2.597,2.597,2.597,2.597,2.597,2.597,2.597,2.597,2.597,2.597
4,2,Afghanistan,7003,March,7271,Temperature change,�C,0.516,1.336,0.403,...,3.390,0.748,-0.527,2.246,-0.076,-0.497,2.296,0.834,4.418,0.234

In [3]:
new = data[["Area", "Months", "Element"]+["Y"+str(i) for i in range(1961,2020)]]

In [4]:
new.columns = ["Area", "Months", "Element"]+[str(i) for i in range(1961,2020)]

In [5]:
final = new.loc[(new.Element=="Temperature change") & (new.Months=="Meteorological year")].drop(["Months", "Element"], axis=1)

In [6]:
final

,Area,1961,1962,1963,1964,1965,1966,1967,1968,1969,...,2010,2011,2012,2013,2014,2015,2016,2017,2018,2019
32,Afghanistan,-0.080,-0.120,0.882,-0.727,-0.200,0.176,-0.361,-0.373,-0.491,...,1.564,1.342,0.102,1.237,0.474,1.096,1.473,1.483,1.524,0.893
66,Albania,0.631,0.339,0.084,-0.171,-0.392,0.551,-0.084,0.071,-0.024,...,1.294,1.123,1.603,1.495,1.399,1.725,1.697,1.337,2.232,1.911
100,Algeria,0.186,0.101,0.045,0.212,-0.135,0.404,-0.024,-0.079,0.262,...,2.359,1.492,1.238,1.267,1.774,1.224,1.866,1.630,1.326,1.224
134,American Samoa,-0.014,-0.080,0.072,-0.226,-0.473,0.177,-0.402,-0.181,0.107,...,1.271,0.790,0.901,1.159,1.086,0.885,1.648,1.268,1.101,1.502
168,Andorra,0.749,0.110,-0.755,0.305,-0.500,0.403,0.616,0.001,-0.156,...,0.441,1.643,1.233,0.794,1.899,1.619,1.917,1.853,1.826,1.871
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
9518,Low Income Food Deficit Countries,-0.085,-0.186,0.072,-0.207,-0.224,0.080,-0.223,-0.265,0.321,...,1.345,0.872,0.618,0.875,0.820,1.061,1.292,1.276,1.094,1.244
9552,Net Food Importing Developing Countries,-0.015,-0.096,0.116,-0.204,-0.155,0.129,-0.233,-0.287,0.266,...,1.350,0.878,0.692,0.977,0.971,1.269,1.374,1.292,1.222,1.412
9586,Annex I countries,0.453,0.161,0.172,-0.366,-0.409,0.270,-0.011,0.058,-0.526,...,1.209,1.090,1.512,1.109,1.119,1.616,2.098,1.607,1.397,1.627
9620,Non-Annex I countries,0.029,-0.059,0.149,-0.174,-0.092,0.151,-0.190,-0.248,0.223,...,1.240,0.801,0.768,0.955,1.003,1.276,1.366,1.316,1.234,1.361
9654,OECD,0.165,-0.009,0.134,-0.190,-0.385,-0.166,-0.090,0.013,-0.068,...,1.246,0.805,1.274,0.991,0.811,1.282,1.850,1.349,1.088,1.297

In [ ]:
final.to_csv("yearly_consumption_by_")

In [1]:
import pandas as pd

data = pd.read_csv("summed_by_country.csv")
data.head()

   Year                 Country Name  CO2 Emission
0  1960                  Afghanistan      0.046057
1  1960  Africa Eastern and Southern      0.906060
2  1960   Africa Western and Central      0.090880
3  1960                      Albania      1.258195
4  1960                      Algeria      0.557120

In [2]:
og = pd.read_csv("API_EN.ATM.CO2E.PC_DS2_en_csv_v2_2917885.csv")

In [8]:
temp = pd.merge(data, og[["Country Name", "Country Code"]], on="Country Name", how="left")

In [11]:
countries = pd.read_csv("country_data.csv")
countries.head()

,Continent_Name,Continent_Code,Country_Name,Two_Letter_Country_Code,Three_Letter_Country_Code,Country_Number
0,Asia,AS,"Afghanistan, Islamic Republic of",AF,AFG,4.0
1,Europe,EU,"Albania, Republic of",AL,ALB,8.0
2,Antarctica,AN,Antarctica (the territory South of 60 deg S),AQ,ATA,10.0
3,Africa,AF,"Algeria, People's Democratic Republic of",DZ,DZA,12.0
4,Oceania,OC,American Samoa,AS,ASM,16.0

In [12]:
new = pd.merge(temp, countries[["Three_Letter_Country_Code", "Continent_Name"]], left_on="Country Code", right_on="Three_Letter_Country_Code", how="left")

In [13]:
new.head()

,Year,Country Name,CO2 Emission,Country Code,Three_Letter_Country_Code,Continent_Name
0,1960,Afghanistan,0.046057,AFG,AFG,Asia
1,1960,Africa Eastern and Southern,0.906060,AFE,NaN,NaN
2,1960,Africa Western and Central,0.090880,AFW,NaN,NaN
3,1960,Albania,1.258195,ALB,ALB,Europe
4,1960,Algeria,0.557120,DZA,DZA,Africa

In [15]:
new_new = new.dropna(axis=0, subset=["Continent_Name"])

In [16]:
new_new.head()

,Year,Country Name,CO2 Emission,Country Code,Three_Letter_Country_Code,Continent_Name
0,1960,Afghanistan,0.046057,AFG,AFG,Asia
3,1960,Albania,1.258195,ALB,ALB,Europe
4,1960,Algeria,0.557120,DZA,DZA,Africa
5,1960,American Samoa,0.000000,ASM,ASM,Oceania
6,1960,Andorra,0.000000,AND,AND,Europe

In [17]:
new_new.to_csv("summed_by_country_with_continents.csv", index=False)

In [18]:
new_new.groupby("Continent_Name").count()

,Year,Country Name,CO2 Emission,Country Code,Three_Letter_Country_Code
Continent_Name,,,,,
Africa,3294,3294,3294,3294,3294
Asia,3111,3111,3111,3111,3111
Europe,3172,3172,3172,3172,3172
North America,2074,2074,2074,2074,2074
Oceania,1159,1159,1159,1159,1159
South America,732,732,732,732,732

In [20]:
data[data.isna().any(axis=1)]

,Year,Country Name,CO2 Emission,Country Code,Continent_Name,Temperature Change,GDP
0,1960,Afghanistan,0.046057,AFG,Asia,NaN,5.377778e+08
1,1960,Albania,1.258195,ALB,Europe,NaN,NaN
2,1960,Algeria,0.557120,DZA,Africa,NaN,2.723593e+09
3,1960,American Samoa,NaN,ASM,Oceania,NaN,NaN
4,1960,Andorra,6.778152,AND,Europe,NaN,NaN
...,...,...,...,...,...,...,...
13537,2020,Virgin Islands (U.S.),NaN,VIR,North America,NaN,NaN
13538,2020,West Bank and Gaza,NaN,PSE,Asia,NaN,1.556130e+10
13539,2020,"Yemen, Rep.",0.442130,YEM,Asia,NaN,NaN
13540,2020,Zambia,0.479936,ZMB,Africa,NaN,1.932005e+10
13541,2020,Zimbabwe,1.201970,ZWE,Africa,NaN,1.676851e+10

In [37]:
continent_a = data[["Year", "Continent_Name", "GDP", "CO2 Emission"]].groupby(["Continent_Name", "Year"]).sum().reset_index()
continent_a.head()

  Continent_Name  Year           GDP  CO2 Emission
0         Africa  1960  3.429277e+11     22.544665
1         Africa  1961  3.413897e+11     22.959048
2         Africa  1962  3.391227e+11     23.680187
3         Africa  1963  3.444565e+11     21.063130
4         Africa  1964  3.440042e+11     21.636742

In [38]:
continent_b = data[["Year", "Continent_Name", "Temperature Change"]].groupby(["Continent_Name", "Year"]).mean().reset_index()
continent_b.head()

  Continent_Name  Year  Temperature Change
0         Africa  1960            0.546401
1         Africa  1961            0.142466
2         Africa  1962            0.050778
3         Africa  1963            0.106403
4         Africa  1964           -0.025159

In [39]:
continent = pd.merge(continent_a, continent_b, on=["Continent_Name", "Year"])
continent.head()

  Continent_Name  Year           GDP  CO2 Emission  Temperature Change
0         Africa  1960  3.429277e+11     22.544665            0.546401
1         Africa  1961  3.413897e+11     22.959048            0.142466
2         Africa  1962  3.391227e+11     23.680187            0.050778
3         Africa  1963  3.444565e+11     21.063130            0.106403
4         Africa  1964  3.440042e+11     21.636742           -0.025159

In [41]:
continent.to_csv("continent_data.csv", index=False)